<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Python_Data_Analytics_Course/blob/main/2_Advanced/02_Pandas_Data_Cleaning.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Pandas Data Cleaning

Load data.

In [9]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

## Handling Missing Data

### Review

This is what we learned in the basics section, this is just a refresher of how we've handled null values before. Feel free to skip this.

#### Notes

- `df.dropna()`: Drop missing values.

##### Examples

Here we are only drop values if all of their values are missing.

In [10]:
df_cleaned = df.dropna(how='all')
df_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 787686 entries, 0 to 787685
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        787686 non-null  object
 1   job_title              787685 non-null  object
 2   job_location           786638 non-null  object
 3   job_via                787678 non-null  object
 4   job_schedule_type      774976 non-null  object
 5   job_work_from_home     787686 non-null  bool
 6   search_location        787686 non-null  object
 7   job_posted_date        787686 non-null  object
 8   job_no_degree_mention  787686 non-null  bool
 9   job_health_insurance   787686 non-null  bool
 10  job_country            787636 non-null  object
 11  salary_rate            33089 non-null   object
 12  salary_year_avg        22046 non-null   float64
 13  salary_hour_avg        10648 non-null   float64
 14  company_name           787669 non-null  object
 15  job_skills             670364 non-null  object
 16  job_type_skills        670364 non-null  object
dtypes: bool(3), float64(2), object(12)
memory usage: 86.4+ MB

Right now all we can do is drop values if they're missing. But that's not useful right now because our DataFrame didn't have any. 

So, what if we wanted to fill the missing values with something else? This is expecially useful so we don't run into errors when dealing with NaN values.

### Fillna

#### Notes

- `df.fillna()`: Fill missing values

#### Examples

Let's fill in instances where there's no salary info (aka these columns have NaN values `salary_rate`, `salary_year_avg`, `salary_hour_avg`) with 0.

We're going to look at a few rows in these 3 columns right now, so we can compare what we've done before to after. 

We'll use `iloc` to look at the first 10 rows `:20` and the salary information rows `11:14`.

In [11]:
df_cleaned.iloc[:10,11:14]

  salary_rate  salary_year_avg  salary_hour_avg
0         NaN              NaN              NaN
1         NaN              NaN              NaN
2        year         425000.0              NaN
3         NaN              NaN              NaN
4         NaN              NaN              NaN
5         NaN              NaN              NaN
6        year         180000.0              NaN
7         NaN              NaN              NaN
8         NaN              NaN              NaN
9         NaN              NaN              NaN

We fill the values for the 3 columns with 0 using `fillna()`.

In [12]:
fill_values = ['salary_rate', 'salary_year_avg', 'salary_hour_avg']
df_filled = df_cleaned.fillna(0)
df_filled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 787686 entries, 0 to 787685
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        787686 non-null  object
 1   job_title              787686 non-null  object
 2   job_location           787686 non-null  object
 3   job_via                787686 non-null  object
 4   job_schedule_type      787686 non-null  object
 5   job_work_from_home     787686 non-null  bool
 6   search_location        787686 non-null  object
 7   job_posted_date        787686 non-null  object
 8   job_no_degree_mention  787686 non-null  bool
 9   job_health_insurance   787686 non-null  bool
 10  job_country            787686 non-null  object
 11  salary_rate            787686 non-null  object
 12  salary_year_avg        787686 non-null  float64
 13  salary_hour_avg        787686 non-null  float64
 14  company_name           787686 non-null  object
 15  job_skills             787686 non-null  object
 16  job_type_skills        787686 non-null  object
dtypes: bool(3), float64(2), object(12)
memory usage: 86.4+ MB

Now if we compare the results using `iloc` again on our new DataFrame. We see that the previous NaN values in the columns ( `salary_rate`, `salary_year_avg`, `salary_hour_avg`) have been replaced with 0.

In [13]:
df_filled.iloc[:10,11:14]

  salary_rate  salary_year_avg  salary_hour_avg
0           0              0.0              0.0
1           0              0.0              0.0
2        year         425000.0              0.0
3           0              0.0              0.0
4           0              0.0              0.0
5           0              0.0              0.0
6        year         180000.0              0.0
7           0              0.0              0.0
8           0              0.0              0.0
9           0              0.0              0.0

## Drop Duplicates

### Notes

* `drop_duplicates()`: Remove duplicate rows.
* Analysts will often need to clean up data and one of the most common issues we run into is duplicate values. 

### Examples

Now that we've dealt with NaN values. Let's continue cleaning the data by removing any duplicate rows.

In [14]:
df_unique = df_filled.drop_duplicates()
df_unique.info()

<class 'pandas.core.frame.DataFrame'>
Index: 787573 entries, 0 to 787685
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        787573 non-null  object
 1   job_title              787573 non-null  object
 2   job_location           787573 non-null  object
 3   job_via                787573 non-null  object
 4   job_schedule_type      787573 non-null  object
 5   job_work_from_home     787573 non-null  bool
 6   search_location        787573 non-null  object
 7   job_posted_date        787573 non-null  object
 8   job_no_degree_mention  787573 non-null  bool
 9   job_health_insurance   787573 non-null  bool
 10  job_country            787573 non-null  object
 11  salary_rate            787573 non-null  object
 12  salary_year_avg        787573 non-null  float64
 13  salary_hour_avg        787573 non-null  float64
 14  company_name           787573 non-null  object
 15  job_skills             787573 non-null  object
 16  job_type_skills        787573 non-null  object
dtypes: bool(3), float64(2), object(12)
memory usage: 92.4+ MB

If you compare that with the original DataFrame which had 787686 entries. This new DataFrame `df_unique` has 787577 entries. It removed 109 entries. 

Now let's see what would happen if we tried to remove duplicates from `job_title`.

In [15]:
df_unique = df_filled.drop_duplicates(subset=['job_title'])
df_unique.info()

<class 'pandas.core.frame.DataFrame'>
Index: 235063 entries, 0 to 787685
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        235063 non-null  object
 1   job_title              235063 non-null  object
 2   job_location           235063 non-null  object
 3   job_via                235063 non-null  object
 4   job_schedule_type      235063 non-null  object
 5   job_work_from_home     235063 non-null  bool
 6   search_location        235063 non-null  object
 7   job_posted_date        235063 non-null  object
 8   job_no_degree_mention  235063 non-null  bool
 9   job_health_insurance   235063 non-null  bool
 10  job_country            235063 non-null  object
 11  salary_rate            235063 non-null  object
 12  salary_year_avg        235063 non-null  float64
 13  salary_hour_avg        235063 non-null  float64
 14  company_name           235063 non-null  object
 15  job_skills             235063 non-null  object
 16  job_type_skills        235063 non-null  object
dtypes: bool(3), float64(2), object(12)
memory usage: 27.6+ MB

If we look at it now. It looks like we removed quite a few rows. Now all of these rows have unique `job_title`s.

In [16]:
df_unique.head(10)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Data Engineer,DevOps Engineer - Big Data/Advanced Analytics,"Bari, Metropolitan City of Bari, Italy",via LinkedIn,Full-time,False,Italy,2023-10-24 18:16:15,True,False,Italy,0,0.0,0.0,NTT DATA Italia,"['shell', 'python', 'bash', 'mongodb', 'mongod...","{'cloud': ['gcp', 'aws', 'azure'], 'databases'..."
1,Data Engineer,"Co-Op/Intern Software Engineer, Data Ingestion","Vancouver, BC, Canada",via LinkedIn,Full-time,False,Canada,2023-05-05 18:37:58,False,False,Canada,0,0.0,0.0,Kinaxis,"['java', 'c#', 'mysql', 'oracle', 'docker', 'k...","{'cloud': ['oracle'], 'databases': ['mysql'], ..."
2,Data Engineer,Hybrid - Data Engineer,"New York, NY",via LinkedIn,Full-time,False,Sudan,2023-07-25 19:07:08,False,False,Sudan,year,425000.0,0.0,Durlston Partners,['python'],{'programming': ['python']}
3,Data Scientist,Data Scientist,"Hamtramck, MI",via BeBee,Full-time,False,"Illinois, United States",2023-11-30 18:05:20,False,False,United States,0,0.0,0.0,Apexon,"['sql', 'r', 'scala', 'java', 'gcp', 'aws', 'h...","{'analyst_tools': ['tableau', 'sap', 'word'], ..."
4,Data Engineer,Data Lead Engineer (with strong Python) - Remo...,Anywhere,via Jobgether,Full-time,True,Panama,2023-08-13 18:32:30,False,False,Panama,0,0.0,0.0,FullStack Labs,"['python', 'aws', 'tableau', 'looker', 'terraf...","{'analyst_tools': ['tableau', 'looker'], 'asyn..."
5,Senior Data Engineer,Senior Data Engineer,"Milford, CT",via Snagajob,Full-time,False,"California, United States",2023-07-28 18:06:44,False,False,United States,0,0.0,0.0,"Franchise World Headquarters, LLC","['python', 'nosql', 'sql', 'aws', 'redshift', ...","{'cloud': ['aws', 'redshift'], 'other': ['flow..."
6,Data Engineer,Data Engineer,Texas,via LinkedIn,Full-time,False,"Texas, United States",2023-03-06 18:51:56,False,True,United States,year,180000.0,0.0,"Trepp, Inc.","['sql', 'python', 'java', 'scala', 'aws', 'spa...","{'cloud': ['aws'], 'libraries': ['spark'], 'ot..."
7,Data Analyst,"Applied Mathematician, Scientist, or Engineer","Copenhagen, Denmark",via BeBee Danmark,Full-time,False,Denmark,2023-07-12 18:24:10,False,False,Denmark,0,0.0,0.0,Signaloid,"['c', 'python', 'github', 'zoom']","{'other': ['github'], 'programming': ['c', 'py..."
8,Senior Data Engineer,"Sr. Big Data Engineer with Data Bricks, Loc - ...","Quincy, MA",via ZipRecruiter,Full-time,False,"California, United States",2023-05-25 18:05:51,True,False,United States,0,0.0,0.0,Apptad Inc,"['sql', 'python', 'aws', 'databricks', 'spark'...","{'cloud': ['aws', 'databricks'], 'libraries': ..."
9,Data Engineer,Azure Data Engineer,"Warren, NJ",via LinkedIn,Contractor,False,"California, United States",2023-09-20 18:05:42,True,False,United States,0,0.0,0.0,Saransh Inc,"['sql', 'azure', 'spark']","{'cloud': ['azure'], 'libraries': ['spark'], '..."

For our example we don't really need to remove any duplicates right now, but it's important to understand the concept.